<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas_chap01_0724.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
data_frame = pd.read_csv('friend_list.csv')  # friend_list.csv 파일에서 데이터를 읽어온다.
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
data_frame.tail(2)   # data_frame 중 뒤에서 2개의 데이터만 보여준다.

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [5]:
type(data_frame.job)   # data_frame.job의 데이터형 보여주기

pandas.core.series.Series

In [6]:
s1 = pd.core.series.Series([1,2,3])  # 시리즈 s1 선언
s2 = pd.core.series.Series(['one','two','three'])  # 시리즈 s2 선언
pd.DataFrame(data = dict(num=s1, word=s2)) # s1, s2로 데이터 프레임

   num   word
0    1    one
1    2    two
2    3  three